# Roughness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPCurveType..::..Roughness Property
MEPCurveType Class See Also
---
The roughness of the MEP curve type. For PipeTypes, please use Segment::Roughness
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Roughness { get; set; }
```

Visual Basic
---
```text
Public Property Roughness As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Roughness {
	double get ();
	void set (double value);
}
```

# See Also
MEPCurveType Class
Autodesk.Revit.DB Namespace